aws/amazon-freertos/vendors/renesas/boards/rx65n-cloud-kit-uart-sx-ulpgn/aws_demos/gcc/src/smc_gen/r_wifi_sx_ulpgn/src/r_wifi_sx_ulpgn_api.c
#define ULPGN_UART_DEFAULT_PORT (0)
#define ULPGN_UART_SECOND_PORT (1)

#define MUTEX_TX (1 << 0)
#define MUTEX_RX (1 << 1)

uint8_t ULPGN_USE_UART_NUM = 2;

uint32_t g_wifi_tx_busiz_command;
uint32_t g_wifi_tx_busiz_data;
uint32_t g_wifi_rx_busiz_command;
uint32_t g_wifi_rx_busiz_data;

uint8_t g_wifi_cleateble_sockets;
uint8_t wifi_command_port;
uint8_t wifi_data_port;

uint8_t  g_wifi_transparent_mode = 0;

const uint8_t ulpgn_socket_status_closed[]       = ULPGN_SOCKET_STATUS_TEXT_CLOSED;
const uint8_t ulpgn_socket_status_socket[]       = ULPGN_SOCKET_STATUS_TEXT_SOCKET;
const uint8_t ulpgn_socket_status_bound[]        = ULPGN_SOCKET_STATUS_TEXT_BOUND;
const uint8_t ulpgn_socket_status_listen[]       = ULPGN_SOCKET_STATUS_TEXT_LISTEN;
const uint8_t ulpgn_socket_status_connected[]    = ULPGN_SOCKET_STATUS_TEXT_CONNECTED;

const uint8_t ulpgn_return_dummy[]   = "";

const uint32_t g_wifi_serial_buffsize_table[2][4] =
{
    /*SCI_TX_BUSIZ_DEFAULT*//*SCI_TX_BUSIZ_SIZE*/   /*SCI_RX_BUSIZ_DEFAULT*/ /*SCI_RX_BUSIZ_SIZE*/
    {SCI_TX_BUSIZ_DEFAULT,  SCI_TX_BUSIZ_DEFAULT,  SCI_RX_BUSIZ_DEFAULT,  SCI_RX_BUSIZ_DEFAULT,  }, /*ULPGN_USE_UART_NUM = 1 */
    {SCI_TX_BUSIZ_SECOND,   SCI_TX_BUSIZ_DEFAULT,  SCI_TX_BUSIZ_SECOND,   SCI_RX_BUSIZ_DEFAULT,  }, /*ULPGN_USE_UART_NUM = 2 */
};


const uint8_t * const wifi_socket_status_tbl[ULPGN_SOCKET_STATUS_MAX] =
{
    ulpgn_socket_status_closed,
    ulpgn_socket_status_socket,
    ulpgn_socket_status_bound,
    ulpgn_socket_status_listen,
    ulpgn_socket_status_connected,
};

volatile uint8_t current_socket_index;


static int32_t wifi_execute_at_command(uint8_t serial_ch_id, uint8_t *ptextstring, uint16_t timeout_ms, wifi_return_code_t expect_code,  wifi_command_list_t command, int32_t socket_no);

static int32_t wifi_take_mutex(uint8_t mutex_flag);
static void wifi_give_mutex(uint8_t mutex_flag);

static void wifi_uart_callback_second_port_for_command(void *pArgs);
static void wifi_uart_callback_default_port_for_inititial(void *pArgs);
static void wifi_uart_callback_default_port_for_data(void *pArgs);
static void timeout_init(int32_t serial_ch, uint16_t timeout_ms);
static void bytetimeout_init(int32_t serial_ch, uint16_t timeout_ms);
static int32_t check_timeout(int32_t serial_ch, int32_t rcvcount);
static int32_t check_bytetimeout(int32_t serial_ch, int32_t rcvcount);
static void socket_timeout_init(uint8_t socket_no, uint32_t timeout_ms, uint8_t flag);
static int32_t socket_check_timeout(uint8_t socket_no, uint8_t flag);

static int32_t wifi_get_ipaddress(void);
static int32_t wifi_serial_open_for_initial(void);
static int32_t wifi_serial_open_for_data(void);
static int32_t wifi_serial_default_port_close(void);
static int32_t wifi_change_command_mode(void);
static int32_t wifi_change_transparent_mode(void);
static int32_t wifi_serial_second_port_open(void);
static int32_t wifi_serial_second_port_close(void);
static int32_t wifi_check_uart_state(uint32_t *uart_receive_status, uint32_t *uart_send_status);

static int32_t wifi_serial_close(void);

static int32_t wifi_get_socket_status(uint8_t socket_no);
static int32_t wifi_change_socket_index(uint8_t socket_no);

/**
 * @brief The global mutex to ensure that only one operation is accessing the
 * g_wifi_tx_semaphore flag at one time.
 */
static SemaphoreHandle_t g_wifi_tx_semaphore = NULL;
static SemaphoreHandle_t g_wifi_rx_semaphore = NULL;

/**
 * @brief Maximum time in ticks to wait for obtaining a semaphore.
 */
static const TickType_t xMaxSemaphoreBlockTime = pdMS_TO_TICKS( 10000UL );

static uint8_t g_temporary_byteq_enable_flag = 0;
static uint8_t g_sockindex_command_flag = 0;

wifi_system_status_t g_wifi_system_state = WIFI_SYSTEM_CLOSE;
uint8_t g_wifi_at_command_buff[WIFI_AT_COMMAND_BUFF_SIZE];
uint8_t g_wifi_at_response_buff[WIFI_AT_RESPONSE_BUFF_SIZE];

wifi_at_communication_info_t g_wifi_uart[WIFI_NUMBER_OF_USE_UART];

uint32_t g_wifi_tx_busiz_command;
uint32_t g_wifi_tx_busiz_data;
uint32_t g_wifi_rx_busiz_command;
uint32_t g_wifi_rx_busiz_data;

uint32_t g_wifi_sci_err_flag;

wifi_err_t R_WIFI_SX_ULPGN_Open(void)
{
    int32_t ret;
    sci_baud_t change_baud;
	uint8_t *pcbuff;
	wifi_err_t api_ret = WIFI_SUCCESS;
	uint8_t open_phase;
	uint8_t byteq_open_count;
	int32_t k;

	if( WIFI_SYSTEM_CLOSE != g_wifi_system_state)
	{
		return WIFI_ERR_ALREADY_OPEN;
	}

	/* Memory initialize */

	wifi_command_port = WIFI_UART_COMMAND_PORT;

    memset(g_wifi_uart, 0, sizeof(g_wifi_uart));
    g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff = g_wifi_at_command_buff;
    g_wifi_uart[WIFI_UART_COMMAND_PORT].command_buff_size = sizeof(g_wifi_at_command_buff);
    g_wifi_uart[WIFI_UART_COMMAND_PORT].response_buff = g_wifi_at_response_buff;
    g_wifi_uart[WIFI_UART_COMMAND_PORT].response_buff_size = sizeof(g_wifi_at_response_buff);
    g_wifi_uart[WIFI_UART_DATA_PORT].command_buff = g_wifi_at_command_buff;
    g_wifi_uart[WIFI_UART_DATA_PORT].command_buff_size = sizeof(g_wifi_at_command_buff);
    g_wifi_uart[WIFI_UART_DATA_PORT].response_buff = g_wifi_at_response_buff;
    g_wifi_uart[WIFI_UART_DATA_PORT].response_buff_size = sizeof(g_wifi_at_response_buff);

    pcbuff = g_wifi_uart[wifi_command_port].command_buff;

	g_wifi_tx_busiz_command = g_wifi_serial_buffsize_table[0][0];
	g_wifi_tx_busiz_data    = g_wifi_serial_buffsize_table[0][0];
	g_wifi_rx_busiz_command = g_wifi_serial_buffsize_table[0][1];
	g_wifi_rx_busiz_data    = g_wifi_serial_buffsize_table[0][1];

	memset(g_wifi_socket, 0, sizeof(g_wifi_socket));

	wifi_init_at_execute_queue();

	open_phase = 0;
	/* Phase 1: ByteQ initialize */
	for(byteq_open_count = 0;byteq_open_count <WIFI_CFG_CREATABLE_SOCKETS; byteq_open_count++)
	{
		if(BYTEQ_SUCCESS != R_BYTEQ_Open(g_wifi_socket[byteq_open_count].socket_recv_buff, sizeof(g_wifi_socket[byteq_open_count].socket_recv_buff), &g_wifi_socket[byteq_open_count].socket_byteq_hdl))
		{
			break;
		}
	}

	if(byteq_open_count >= WIFI_CFG_CREATABLE_SOCKETS)
	{
		/* Success */
		open_phase |= 0x01;
	}
	else
	{
		api_ret = WIFI_ERR_BYTEQ_OPEN;
	}

	if(WIFI_SUCCESS == api_ret)
	{
	    /* Phase 3 Semaphore tx initialize */
	    if (g_wifi_tx_semaphore != NULL)
	    {
	        vSemaphoreDelete(g_wifi_tx_semaphore);
	    }
	    g_wifi_tx_semaphore = xSemaphoreCreateMutex();

	    if( g_wifi_tx_semaphore != NULL )
	    {
			/* Success */
			open_phase |= 0x02;
	    }
	    else
	    {
	    	api_ret = WIFI_ERR_TAKE_MUTEX;
	    }
	}

	if(WIFI_SUCCESS == api_ret)
	{
	    /* Phase 4 Semaphore rx initialize */
	    if (g_wifi_rx_semaphore != NULL)
	    {
	        vSemaphoreDelete(g_wifi_rx_semaphore);
	    }

	    g_wifi_rx_semaphore = xSemaphoreCreateMutex();

	    if( g_wifi_rx_semaphore != NULL )
	    {
			/* Success */
			open_phase |= 0x04;
	    }
	    else
	    {
	    	api_ret = WIFI_ERR_TAKE_MUTEX;
	    }
	}

	if(WIFI_SUCCESS == api_ret)
	{
	    /* Phase 4 Serial initialize */
        WIFI_RESET_DR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 0;
        WIFI_RESET_DDR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 1;
	    R_BSP_SoftwareDelay(26, BSP_DELAY_MILLISECS); /* 5us mergin 1us */
		WIFI_RESET_DR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 1;
	    R_BSP_SoftwareDelay(200, BSP_DELAY_MILLISECS); /*  */

		ret = wifi_serial_open_for_initial();
		if(0 == ret)
		{
			/* Success */
			open_phase |= 0x08;
		}
		else
		{
	    	api_ret = WIFI_ERR_SERIAL_OPEN;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
	    ret = wifi_serial_second_port_open();
	    ret = 0;
	    if(ret == 0)
	    {
			/* Success */
			open_phase |= 0x08;
	    }
	    else
	    {
	    	api_ret = WIFI_ERR_SERIAL_OPEN;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
	    /* Phase 5 Task initialize */
		if(0 == wifi_start_recv_task())
		{
			vTaskDelay( 2 );
			/* Success */
			open_phase |= 0x10;
		}
		else
		{
			api_ret = WIFI_ERR_SERIAL_OPEN;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		/* no echo */
		ret = wifi_execute_at_command(wifi_command_port, "ATE0\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_ECHO_OFF, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}

	if(WIFI_SUCCESS == api_ret)
	{
		/* no echo */
		ret = wifi_execute_at_command(wifi_command_port, "ATWREV\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_MODULE_VERSION, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
	    /* Command Port = HSUART2 */
		ret = wifi_execute_at_command(wifi_command_port, "ATUART=2\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_UART_CHANGE_TO_2, 0xff);
	    if(ret != 0)
	    {
			api_ret = WIFI_ERR_MODULE_COM;
	    }
	    else
	    {
	    	R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS); /* 1 sec */
	    	wifi_command_port = ULPGN_UART_SECOND_PORT;
	        wifi_serial_default_port_close();
	    }
	}

	if(WIFI_SUCCESS == api_ret)
	{
		/* Command Port = HSUART2, Data Port = HSUART1 */
		ret = wifi_execute_at_command(wifi_command_port, "ATE0\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_ECHO_OFF, 0xff);
		if(ret == 0)
		{
			/* Multiple Connection */
	        /* Change HSUART1 baudrate and flow control. */
#if (WIFI_CFG_SCI_USE_FLOW_CONTROL == 1)
//	        sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATBX1=%d,,,,h\r",WIFI_CFG_SCI_BAUDRATE);
#else
	        sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATBX1=%d,,,,\r",WIFI_CFG_SCI_BAUDRATE);
#endif
			ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_UART_HISPEED, 0xff);
	        if(ret != 0)
	        {
	            return ret;
	        }

	        ret = wifi_serial_open_for_data();
	        if(ret != 0)
	        {
	            return ret;
	        }
	        R_SCI_Control(g_wifi_uart[ULPGN_UART_DEFAULT_PORT].wifi_uart_sci_handle, SCI_CMD_EN_CTS_IN, NULL);
	        WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
	        WIFI_RTS_DDR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 1;
	        R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);

			ret = wifi_execute_at_command(wifi_command_port, "ATUART=2,1\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_UART_CHANGE_TO_21, 0xff);
	        if(ret != 0)
	        {
	            return ret;
	        }
	        R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS); /* 1 sec */

	        ULPGN_USE_UART_NUM = 2;
	        g_wifi_cleateble_sockets = WIFI_CFG_CREATABLE_SOCKETS;
	        wifi_command_port = ULPGN_UART_SECOND_PORT;
	        wifi_data_port = ULPGN_UART_DEFAULT_PORT;
	        g_wifi_tx_busiz_command = g_wifi_serial_buffsize_table[1][0];
	        g_wifi_tx_busiz_data    = g_wifi_serial_buffsize_table[1][1];
	        g_wifi_rx_busiz_command = g_wifi_serial_buffsize_table[1][2];
	        g_wifi_rx_busiz_data    = g_wifi_serial_buffsize_table[1][3];


