aws/amazon-freertos/vendors/renesas/boards/rx65n-cloud-kit-uart-sx-ulpgn/aws_demos/gcc/src/smc_gen/r_wifi_sx_ulpgn/src/r_wifi_sx_ulpgn_api.c
		}
		else
		{
			/* Single Connection */
	        ret = wifi_serial_second_port_close();

	    	wifi_init_at_execute_queue();
	        ULPGN_USE_UART_NUM = 1;
	        g_wifi_cleateble_sockets = 1;
	        wifi_command_port = ULPGN_UART_DEFAULT_PORT;
	        wifi_data_port = ULPGN_UART_DEFAULT_PORT;
	        g_wifi_tx_busiz_command = g_wifi_serial_buffsize_table[0][0];
	        g_wifi_tx_busiz_data    = g_wifi_serial_buffsize_table[0][1];
	        g_wifi_rx_busiz_command = g_wifi_serial_buffsize_table[0][2];
	        g_wifi_rx_busiz_data    = g_wifi_serial_buffsize_table[0][3];

	        /* Wifi Module hardware reset   */
	        WIFI_RESET_DR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 0;
	        WIFI_RESET_DDR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 1;
	        R_BSP_SoftwareDelay(26, BSP_DELAY_MILLISECS); /* 5us mergin 1us */
	        WIFI_RESET_DR(WIFI_CFG_RESET_PORT, WIFI_CFG_RESET_PIN) = 1;
	        R_BSP_SoftwareDelay(200, BSP_DELAY_MILLISECS); /*  */

	        ret = wifi_serial_open_for_initial();
	        if(ret != 0)
	        {
	            return ret;
	        }


	        /* no echo */
			ret = wifi_execute_at_command(wifi_command_port, "ATE0\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_ECHO_OFF, 0xff);
	        if(ret != 0)
	        {
	            return ret;
	        }

	        /* Change HSUART1 baudrate and flow control. */
#if (WIFI_CFG_SCI_USE_FLOW_CONTROL == 1)
//	        sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATBX1=%d,,,,h\r",WIFI_CFG_SCI_BAUDRATE);
#else
	        sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATBX1=%d,,,,\r",WIFI_CFG_SCI_BAUDRATE);
#endif
			ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_UART_HISPEED, 0xff);
	        if(ret != 0)
	        {
	            return ret;
	        }
	        change_baud.pclk = BSP_PCLKB_HZ;
	        change_baud.rate = WIFI_CFG_SCI_BAUDRATE;
	        R_SCI_Control(g_wifi_uart[wifi_command_port].wifi_uart_sci_handle, SCI_CMD_CHANGE_BAUD, &change_baud);
	        R_SCI_Control(g_wifi_uart[wifi_command_port].wifi_uart_sci_handle, SCI_CMD_EN_CTS_IN, NULL);
	        WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
	        WIFI_RTS_DDR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 1;

	        R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS); /* 5us mergin 1us */

		}

	}
	if(WIFI_SUCCESS == api_ret)
	{
		/* UART transmission flow control busy retry timeout */
		ret = wifi_execute_at_command(wifi_command_port, "ATS108=1\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_UART_FLOW_TIMEOUT, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		/* Escape guard time = 200msec */
		ret = wifi_execute_at_command(wifi_command_port, "ATS12=1\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_ESCAPE_GUARD_TIME, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		/* Buffer size = 1420byte */
		ret = wifi_execute_at_command(wifi_command_port, "ATBSIZE=1420\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_BUFFER_THRESHOLD, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		/* Disconnect from currently connected Access Point, */
		ret = wifi_execute_at_command(wifi_command_port, "ATWD\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_WIFI_DISCONNECT, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
		else
		{
		    current_socket_index = 0;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		/* Receive timeout  */
		ret = wifi_execute_at_command(wifi_command_port, "ATTO=1\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_AT_RECV_TIMEOUT, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		/* Receive timeout  */
		ret = wifi_execute_at_command(wifi_command_port, "ATS110=0\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_AUTOCLOSE, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		/* Receive timeout  */
		ret = wifi_execute_at_command(wifi_command_port, "ATS105=0\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_AUTO_TRANSPARENT_MODE, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	g_wifi_system_state = WIFI_SYSTEM_OPEN;
    return api_ret;
}

wifi_err_t R_WIFI_SX_ULPGN_Close(void)
{
	int i;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if(0 == R_WIFI_SX_ULPGN_IsConnected())
	{
		R_WIFI_SX_ULPGN_Disconnect();
	}
	wifi_serial_close();
	wifi_delete_recv_task();
	for(i=0; i<WIFI_CFG_CREATABLE_SOCKETS; i++)
	{
		R_BYTEQ_Close(g_wifi_socket[i].socket_byteq_hdl);
	}

	g_wifi_system_state = WIFI_SYSTEM_CLOSE;

	return api_ret;
}

wifi_err_t R_WIFI_SX_ULPGN_SetDnsServerAddress(uint32_t dnsaddress1, uint32_t dnsaddress2)
{
	int32_t ret;
	wifi_err_t api_ret = WIFI_SUCCESS;
    uint8_t mutex_flag;
	uint8_t *pcbuff = g_wifi_uart[wifi_command_port].command_buff;

	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
		wifi_change_command_mode();
		if(dnsaddress1 != 0)
		{
//			sprintf((char *)pcbuff,"ATNDNSSVR1=%d.%d.%d.%d\r",
//					WIFI_ULONG_TO_IPV4BYTE_1(dnsaddress1), WIFI_ULONG_TO_IPV4BYTE_2(dnsaddress1),
//					WIFI_ULONG_TO_IPV4BYTE_3(dnsaddress1), WIFI_ULONG_TO_IPV4BYTE_4(dnsaddress1));
			ret = wifi_execute_at_command(wifi_command_port, pcbuff, 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DNS_SRV_ADDRESS, 0xff);
			if(ret != 0)
			{
				api_ret = WIFI_ERR_MODULE_COM;
			}
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		if(dnsaddress2 != 0)
		{
//			sprintf((char *)pcbuff,"ATNDNSSVR2=%d.%d.%d.%d\r",
//					WIFI_ULONG_TO_IPV4BYTE_1(dnsaddress2), WIFI_ULONG_TO_IPV4BYTE_2(dnsaddress2),
//					WIFI_ULONG_TO_IPV4BYTE_3(dnsaddress2), WIFI_ULONG_TO_IPV4BYTE_4(dnsaddress2));
			ret = wifi_execute_at_command(wifi_command_port, pcbuff, 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DNS_SRV_ADDRESS, 0xff);
			if(ret != 0)
			{
				api_ret = WIFI_ERR_MODULE_COM;
			}
		}
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}
	return api_ret;

