aws/amazon-freertos/vendors/renesas/boards/rx65n-cloud-kit-uart-sx-ulpgn/aws_demos/gcc/src/smc_gen/r_wifi_sx_ulpgn/src/r_wifi_sx_ulpgn_api.c
}



wifi_err_t R_WIFI_SX_ULPGN_Connect (uint8_t *pssid, uint8_t *ppass, uint32_t security, uint8_t dhcp_enable, wifi_ip_configuration_t *pipconfig)
{
    int32_t ret;
    char *pstr, pstr2;
    uint32_t security_encrypt_type = 1;
    uint8_t mutex_flag;
    uint8_t security_type;
    uint8_t retry_count;
    uint8_t getip_retry_count;
    wifi_err_t api_ret = WIFI_SUCCESS;
	uint8_t *pcbuff = g_wifi_uart[wifi_command_port].command_buff;

	if((pssid == NULL) || (ppass == NULL) || ((security != WIFI_SECURITY_WPA) && (security != WIFI_SECURITY_WPA2)) || (pipconfig == NULL))
	{
		return WIFI_ERR_PARAMETER;
	}
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}
	if( 0 == R_WIFI_SX_ULPGN_IsConnected())
	{
		/* Nothing to do. */
		return WIFI_SUCCESS;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
		if(0 == dhcp_enable)
		{
			/* DHCP Not Use */
			ret = wifi_execute_at_command(wifi_command_port, "ATNDHCP=0\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DHCP_MODE, 0xff);
			if(ret != 0)
			{
				api_ret = WIFI_ERR_MODULE_COM;
			}
			if(WIFI_SUCCESS == api_ret)
			{
//				sprintf((char *)pcbuff,"ATNSET=%d.%d.%d.%d,%d.%d.%d.%d,%d.%d.%d.%d\r\n",
//						WIFI_ULONG_TO_IPV4BYTE_1(pipconfig->ipaddress), WIFI_ULONG_TO_IPV4BYTE_2(pipconfig->ipaddress),
//						WIFI_ULONG_TO_IPV4BYTE_3(pipconfig->ipaddress), WIFI_ULONG_TO_IPV4BYTE_4(pipconfig->ipaddress),
//						WIFI_ULONG_TO_IPV4BYTE_1(pipconfig->subnetmask), WIFI_ULONG_TO_IPV4BYTE_2(pipconfig->subnetmask),
//						WIFI_ULONG_TO_IPV4BYTE_3(pipconfig->subnetmask), WIFI_ULONG_TO_IPV4BYTE_4(pipconfig->subnetmask),
//						WIFI_ULONG_TO_IPV4BYTE_1(pipconfig->gateway), WIFI_ULONG_TO_IPV4BYTE_2(pipconfig->gateway),
//						WIFI_ULONG_TO_IPV4BYTE_3(pipconfig->gateway), WIFI_ULONG_TO_IPV4BYTE_4(pipconfig->gateway));

				/* Set Static IP address */
				ret = wifi_execute_at_command(wifi_command_port, pcbuff, 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_STATIC_IP, 0xff);
				if(ret != 0)
				{
					api_ret = WIFI_ERR_MODULE_COM;
				}
			}
		}
		else
		{
			/* DHCP Use */
			ret = wifi_execute_at_command(wifi_command_port, "ATNDHCP=1\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DHCP_MODE, 0xff);
			if(ret != 0)
			{
				api_ret = WIFI_ERR_MODULE_COM;
			}
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		if(0 ==  R_WIFI_SX_ULPGN_IsConnected())
		{
			/* If Wifi is already connected, do nothing and return fail. */
			wifi_give_mutex(mutex_flag);
			if(0 != R_WIFI_SX_ULPGN_Disconnect())
			{
				api_ret = WIFI_ERR_MODULE_COM;
			}
			if(WIFI_SUCCESS == api_ret)
			{
				if(0 != wifi_take_mutex(mutex_flag))
				{
					api_ret = WIFI_ERR_TAKE_MUTEX;
				}
			}
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		R_BSP_SoftwareDelay(2000, BSP_DELAY_MILLISECS);

		if(security == WIFI_SECURITY_WPA)
		{
			security_type = 1;
		}
		else
		{
			security_type = 2;
		}

		for(retry_count = 0;retry_count < 3;retry_count++)
		{
//			sprintf((char *)pcbuff,"ATWAWPA=%s,%d,1,1,%s\r",pssid,security_type,ppass);
			ret = wifi_execute_at_command(wifi_command_port, pcbuff, 20000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_WIFI_CONNECT, 0xff);
			if((0 == ret) || (-2 == ret))
			{
				if(-2 == ret)
				{
					memset(g_wifi_current_ssid, 0, sizeof(g_wifi_current_ssid));
					ret = wifi_execute_at_command(wifi_command_port, "ATW\r", 1000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_CURRENT_SSID, 0xff);
					if(0 == ret)
					{
						ret = -1;
						if( 0 == strcmp((const char *)g_wifi_current_ssid, (const char *)pssid))
						{
							ret = 0;
						}
					}
				}
			}
			if(0 != ret)
			{
				wifi_execute_at_command(wifi_command_port, "ATWD\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_WIFI_DISCONNECT, 0xff);
			}
			else
			{
				break;
			}
		}
		if(retry_count >= 3)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		if(0 != dhcp_enable)
		{
			for(getip_retry_count = 0;getip_retry_count<10;getip_retry_count++)
			{
				ret = wifi_get_ipaddress();
				if((0 == ret) && (g_wifi_ipconfig.ipaddress != 0))
				{
					break;
				}
				else
				{
					vTaskDelay(1000);
				}
			}
			if(getip_retry_count >=10)
			{
				wifi_execute_at_command(wifi_command_port, "ATWD\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_WIFI_DISCONNECT, 0xff);
				api_ret = WIFI_ERR_MODULE_COM;
			}
		}
	}

	if(WIFI_SUCCESS == api_ret)
	{
		g_wifi_system_state = WIFI_SYSTEM_CONNECT;
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}
    return api_ret;
}

wifi_err_t R_WIFI_SX_ULPGN_Disconnect(void)
{
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}
	if( WIFI_SYSTEM_OPEN == g_wifi_system_state)
	{
		/* Nothing to do. */
		return WIFI_SUCCESS;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
		wifi_change_command_mode();
		wifi_execute_at_command(wifi_command_port, "ATWD\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_WIFI_DISCONNECT, 0xff);
		memset(&g_wifi_ipconfig, 0, sizeof(g_wifi_ipconfig));
		g_wifi_system_state = WIFI_SYSTEM_OPEN;
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}

    return api_ret;
}

int32_t R_WIFI_SX_ULPGN_IsConnected(void)
{
	int32_t ret = -1;

	if(WIFI_SYSTEM_CONNECT == g_wifi_system_state)
	{
		ret = 0;
	}
	return ret;
}



wifi_err_t R_WIFI_SX_ULPGN_GetMacAddress (uint8_t *pmacaddress)
{
	int32_t ret;
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if(NULL == pmacaddress)
	{
		return WIFI_ERR_PARAMETER;
	}
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}
    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}

    if(WIFI_SUCCESS == api_ret)
	{
		ret = wifi_execute_at_command(wifi_command_port, "ATW\r\n", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_MACADDRESS, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
		memcpy(pmacaddress, g_wifi_macaddress, sizeof(g_wifi_macaddress));
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}
	return api_ret;
}

wifi_err_t R_WIFI_SX_ULPGN_GetIpAddress (wifi_ip_configuration_t *pipconfig)
{
	int32_t ret;
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

