aws/amazon-freertos/vendors/renesas/boards/rx65n-cloud-kit-uart-sx-ulpgn/aws_demos/gcc/src/smc_gen/r_wifi_sx_ulpgn/src/r_wifi_sx_ulpgn_api.c
	if(NULL == pipconfig)
	{
		return WIFI_ERR_PARAMETER;
	}
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}

    if(WIFI_SUCCESS == api_ret)
	{
        ret = wifi_get_ipaddress();
		if(ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		memcpy(pipconfig, &g_wifi_ipconfig, sizeof(wifi_ip_configuration_t));
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}
	return api_ret;
}

wifi_err_t R_WIFI_SX_ULPGN_Scan (wifi_scan_result_t *pap_results, uint32_t maxnetworks, uint32_t *exist_ap_list)
{
    int32_t i;
    int32_t ret;
    uint8_t retry_count;
    uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

    if ((NULL == pap_results) || (0 == maxnetworks) || (NULL == exist_ap_list))
    {
    	return WIFI_ERR_PARAMETER;
    }
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
	    gp_wifi_ap_results = pap_results;
	    g_wifi_aplistmax = maxnetworks;
		g_wifi_aplist_stored_num = 0;
		g_wifi_aplist_count = 0;
		g_wifi_aplist_subcount = 0;
		memset(gp_wifi_ap_results,0x00,sizeof(wifi_scan_result_t)*maxnetworks);
		for(i=0; i<maxnetworks; i++)
		{
			gp_wifi_ap_results[i].security = WIFI_SECURITY_UNDEFINED;
		}
	    // TODO investigate why this never returns the full response
		for (retry_count = 0; retry_count < 3; retry_count++)
		{
			ret = wifi_execute_at_command(wifi_command_port, "ATWS\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_APLIST, 0xff);
			if(ret == 0)
			{
				*exist_ap_list = g_wifi_aplist_count;
				break;
	        }
	    }
		if(retry_count >= 3)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}

	return api_ret;
}




int32_t sx_ulpgn_get_tcp_socket_status(uint8_t socket_no)
{
	if(socket_no >= g_wifi_cleateble_sockets)
	{
	    return -1;
	}
	return g_wifi_socket[socket_no].socket_status;
}

int32_t    R_WIFI_SX_ULPGN_SocketCreate(uint32_t type, uint32_t ipversion)
{
	int32_t i;
	int32_t ret = WIFI_ERR_SOCKET_CREATE;
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if(type != WIFI_SOCKET_IP_PROTOCOL_TCP || ipversion != WIFI_SOCKET_IP_VERSION_4)
	{
		return WIFI_ERR_PARAMETER;
	}
	if( 0 != R_WIFI_SX_ULPGN_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	mutex_flag = (MUTEX_TX | MUTEX_RX);
	if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
		for(i=0;i<g_wifi_cleateble_sockets;i++)
		{
			if(g_wifi_socket[i].socket_create_flag == 0)
			{
				break;
			}
		}
		if(i >=g_wifi_cleateble_sockets)
		{
			api_ret = WIFI_ERR_SOCKET_NUM;
		}
		if(WIFI_SUCCESS == api_ret)
		{
			g_wifi_socket[i].socket_create_flag = 1;
			g_wifi_socket[i].ipversion = ipversion;
			g_wifi_socket[i].protocol = type;
			g_wifi_socket[i].socket_status = WIFI_SOCKET_STATUS_SOCKET;
			g_wifi_socket[i].ssl_flag = 0;
			g_wifi_socket[i].ssl_type = 0;
			R_BYTEQ_Flush(g_wifi_socket[i].socket_byteq_hdl);
			ret = i;
		}
		else
		{
			ret = WIFI_ERR_SOCKET_CREATE;
		}
	}
	if(api_ret != WIFI_ERR_TAKE_MUTEX)
	{
		/* Give back the socketInUse mutex. */
		wifi_give_mutex(mutex_flag);
	}
    return ret;
}

wifi_err_t R_WIFI_SX_ULPGN_SocketConnect(int32_t socket_no, uint32_t ipaddr, uint16_t port)
{
	int32_t ret;
	uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

	if( (0 == ipaddr) || (0 == port) )
	{
		return  WIFI_ERR_PARAMETER;
	}
	if( (socket_no >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_no < 0) || (g_wifi_socket[socket_no].socket_status != WIFI_SOCKET_STATUS_SOCKET) )
	{
		return  WIFI_ERR_SOCKET_NUM;
	}
	if( 0 != R_WIFI_SX_ULPGN_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	mutex_flag = (MUTEX_TX | MUTEX_RX);
	if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
		if(ULPGN_USE_UART_NUM == 2)
		{
			ret = wifi_change_socket_index(socket_no);
			if(ret != 0)
			{
				api_ret = WIFI_ERR_CHANGE_SOCKET;
			}
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
//		sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNSOCK=%d,%d\r", 0, 4);
		ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CREATE, 0xff);
		if(ret != 0)
		{
			api_ret = WIFI_ERR_SOCKET_CREATE;
		}
	}

	if(WIFI_SUCCESS == api_ret)
	{
//		sprintf((char *)g_wifi_uart[wifi_command_port].command_buff,"ATNCTCP=%d.%d.%d.%d,%d\r",
//				WIFI_ULONG_TO_IPV4BYTE_1(ipaddr), WIFI_ULONG_TO_IPV4BYTE_2(ipaddr),
//				WIFI_ULONG_TO_IPV4BYTE_3(ipaddr), WIFI_ULONG_TO_IPV4BYTE_4(ipaddr),
//				port);
		if(ULPGN_USE_UART_NUM == 2)
		{
			ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, 15000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CONNECT, socket_no);
		}
		else
		{
			ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, 15000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CONNECT, socket_no);
		}
		if(ret != 0)
		{
			wifi_execute_at_command(wifi_command_port, "ATNCLOSE\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CLOSE, socket_no);
			R_BSP_SoftwareDelay(500, BSP_DELAY_MILLISECS);
			api_ret = WIFI_ERR_MODULE_COM;
		}
	}
	if(WIFI_SUCCESS == api_ret)
	{
		g_wifi_socket[socket_no].socket_status = WIFI_SOCKET_STATUS_CONNECTED;
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}

    return api_ret;

}

int32_t R_WIFI_SX_ULPGN_SocketSend (int32_t socket_no, uint8_t *pdata, int32_t length, uint32_t timeout_ms)
{
	volatile int32_t timeout;
	volatile int32_t sended_length;
    int32_t current_send_length;
    int32_t ret;
    sci_err_t ercd;
	int32_t api_ret = 0;

	if( (pdata == NULL) || (length < 0 ))
	{
		return  WIFI_ERR_PARAMETER;
	}

	if( 0 != R_WIFI_SX_ULPGN_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	if( (socket_no >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_no < 0) || (0 == g_wifi_socket[socket_no].socket_create_flag) || (g_wifi_socket[socket_no].socket_status != WIFI_SOCKET_STATUS_CONNECTED) )
	{
		return  WIFI_ERR_SOCKET_NUM;
	}

    if(0 == wifi_take_mutex(MUTEX_TX))
	{
		sended_length = 0;

		if(ULPGN_USE_UART_NUM == 2)
        {
        	if(socket_no != current_socket_index)
        	{
        	    if(0 != wifi_take_mutex(MUTEX_RX))
        		{
        	    	wifi_give_mutex(MUTEX_TX);
        	    	return WIFI_ERR_TAKE_MUTEX;
        		}
                ret = wifi_change_socket_index(socket_no);
    	    	wifi_give_mutex(MUTEX_RX);
                if(ret != 0)
                {
                    /* Give back the socketInUse mutex. */
        	    	wifi_give_mutex(MUTEX_TX);
        	    	return WIFI_ERR_CHANGE_SOCKET;
                }
        	}
        }
		if(ULPGN_USE_UART_NUM == 1)
        {
			if(0 == g_wifi_transparent_mode)
			{
        	    if(0 != wifi_take_mutex(MUTEX_RX))
        		{
        	    	wifi_give_mutex(MUTEX_TX);
        	    	return WIFI_ERR_TAKE_MUTEX;
        		}
        	    ret = wifi_change_transparent_mode();
    	    	wifi_give_mutex(MUTEX_RX);
                if(ret != 0)
                {
                    /* Give back the socketInUse mutex. */
        	    	wifi_give_mutex(MUTEX_TX);
        	    	return WIFI_ERR_MODULE_COM;
                }
			}
        }

		if(0 != timeout_ms)
		{
			socket_timeout_init(socket_no, timeout_ms, 0);
		}

        timeout = 0;

        while(sended_length < length)
        {
            if(length - sended_length > g_wifi_tx_busiz_data)
            {
                current_send_length = g_wifi_tx_busiz_data;
            }
            else
            {
                current_send_length = length - sended_length;
            }

            if(current_send_length > WIFI_SOCKET_SENDABLE_DATASIZE)
            {
            	current_send_length = WIFI_SOCKET_SENDABLE_DATASIZE;
            }

