aws/amazon-freertos/vendors/renesas/boards/rx65n-cloud-kit-uart-sx-ulpgn/aws_demos/gcc/src/smc_gen/r_wifi_sx_ulpgn/src/r_wifi_sx_ulpgn_api.c
            g_wifi_uart[wifi_data_port].tx_end_flag = 0;
            ercd = R_SCI_Send(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,
            		 (uint8_t *)pdata + sended_length, current_send_length);
            if(SCI_SUCCESS != ercd)
            {
            	break;
            }

            while(1)
            {
                if(0 != g_wifi_uart[wifi_data_port].tx_end_flag)
                {
                    break;
                }
                vTaskDelay(1);
            }

            sended_length += current_send_length;
            if(-1 == socket_check_timeout(socket_no, 0))
            {
            	break;
            }
        }
		api_ret = sended_length;

        /* Give back the socketInUse mutex. */
    	wifi_give_mutex(MUTEX_TX);
    }
    else
    {
    	api_ret = WIFI_ERR_TAKE_MUTEX;
    }
    return api_ret;
}

int32_t R_WIFI_SX_ULPGN_SocketRecv (int32_t socket_no, uint8_t *pdata, int32_t length, uint32_t timeout_ms)
{
    sci_err_t ercd;
    uint32_t recvcnt = 0;
    int32_t ret;
    byteq_err_t byteq_ret;
	int32_t api_ret;
	volatile int32_t timeout;
	uint32_t ipl;

	if( (pdata == NULL) || (length <= 0 ))
	{
		return  WIFI_ERR_PARAMETER;
	}

	if( 0 != R_WIFI_SX_ULPGN_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	if( (socket_no >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_no < 0) || (0 == g_wifi_socket[socket_no].socket_create_flag) ||  (g_wifi_socket[socket_no].socket_status != WIFI_SOCKET_STATUS_CONNECTED) )
	{
		return  WIFI_ERR_SOCKET_NUM;
	}

    if(0 == wifi_take_mutex(MUTEX_RX))
    {
		if(ULPGN_USE_UART_NUM == 2)
		{
			if(socket_no != current_socket_index)
			{
				wifi_give_mutex(MUTEX_RX);
				if(0 != wifi_take_mutex(MUTEX_TX | MUTEX_RX))
				{
					return -1;
				}
				ret = wifi_change_socket_index(socket_no);
				wifi_give_mutex(MUTEX_TX);
				if(ret != 0)
				{
					/* Give back the socketInUse mutex. */
					wifi_give_mutex(MUTEX_RX);
					return -1;
				}
			}
		}
		if(ULPGN_USE_UART_NUM == 1)
		{
			if(0 == g_wifi_transparent_mode)
			{
				wifi_give_mutex(MUTEX_RX);
				if(0 != wifi_take_mutex(MUTEX_TX | MUTEX_RX))
				{
					return -1;
				}
				ret = wifi_change_transparent_mode();
				wifi_give_mutex(MUTEX_TX);
				if(ret != 0)
				{
					/* Give back the socketInUse mutex. */
					wifi_give_mutex(MUTEX_RX);
					return -1;
				}
			}
		}
		if((timeout_ms != 0) && (timeout_ms != portMAX_DELAY))
		{
			socket_timeout_init(socket_no, timeout_ms, 1);
		}

		while(1)
		{
			ipl = R_BSP_CpuInterruptLevelRead();
			R_BSP_CpuInterruptLevelWrite (WIFI_CFG_SCI_INTERRUPT_LEVEL);
			byteq_ret = R_BYTEQ_Get(g_wifi_socket[current_socket_index].socket_byteq_hdl, (pdata + recvcnt));
			R_BSP_CpuInterruptLevelWrite (ipl);

			if(BYTEQ_SUCCESS == byteq_ret)
			{
				recvcnt++;
				if(recvcnt >= length)
				{
					break;
				}
				continue;
			}
			if(g_wifi_socket[socket_no].socket_status != WIFI_SOCKET_STATUS_CONNECTED)
			{
				break;
			}
			if(g_wifi_system_state != WIFI_SYSTEM_CONNECT)
			{
				break;
			}
			if((timeout_ms != 0) && (timeout_ms != portMAX_DELAY))
			{
				if(-1 == socket_check_timeout(socket_no, 1))
				{
	#if DEBUGLOG == 1
					R_BSP_CpuInterruptLevelWrite (13);
//		                printf("recv timeout.%d received. requestsize=%d,lastdata=%02x,data1=%02x\r\n",recvcnt,length,*(pdata + (recvcnt-1)),data1);
					R_BSP_CpuInterruptLevelWrite (0);
	#endif
					R_BSP_NOP();
					break;
				}
			}
			vTaskDelay(1);
		}
#if 0
		if(recvcnt == 0)
		{
			ret = wifi_get_socket_status(socket_no);
			if(ret != ULPGN_SOCKET_STATUS_CONNECTED)
			{
				/* Give back the socketInUse mutex. */
				( void ) xSemaphoreGive( g_wifi_rx_semaphore );
				return 0;
			}
			/* socket is not closed, and recieve data size is 0. */
			( void ) xSemaphoreGive( g_wifi_rx_semaphore );
			return 0;
		}
#endif
		/* socket is not closed, and recieve data size is 0. */
		/* Give back the socketInUse mutex. */
		api_ret = recvcnt;
		wifi_give_mutex(MUTEX_RX);
#if DEBUGLOG == 1
		tmptime2 = xTaskGetTickCount();
		R_BSP_CpuInterruptLevelWrite (13);
		printf("r:%06d:tcp %ld byte received.reqsize=%ld,%x\r\n", tmptime2, recvcnt, length, (uint32_t)pdata);
		R_BSP_CpuInterruptLevelWrite (0);
#endif

	}

    return api_ret;
}

wifi_err_t R_WIFI_SX_ULPGN_SocketShutdown (int32_t socket_no)
{
	wifi_err_t api_ret = WIFI_SUCCESS;
	int32_t subroutain_ret;
	uint8_t mutex_flag;

	if((socket_no >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_no < 0) ||
			(0 == g_wifi_socket[socket_no].socket_create_flag) || (g_wifi_socket[socket_no].socket_status <= WIFI_SOCKET_STATUS_SOCKET))
	{
		return WIFI_ERR_SOCKET_NUM;
	}
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}
	mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
    if(WIFI_SUCCESS == api_ret)
    {
		if(ULPGN_USE_UART_NUM == 2)
		{
			subroutain_ret = wifi_change_socket_index(socket_no);
			if(subroutain_ret != 0)
			{
				api_ret = WIFI_ERR_CHANGE_SOCKET;
			}
		}
		if(ULPGN_USE_UART_NUM == 1)
		{
			wifi_change_command_mode();
		}
    }
    if(WIFI_SUCCESS == api_ret)
    {
		subroutain_ret = wifi_execute_at_command(wifi_command_port, "ATNCLOSE\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CLOSE, socket_no);
		if(0 != subroutain_ret)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
		else
		{
			g_wifi_socket[socket_no].socket_status = WIFI_SOCKET_STATUS_SOCKET;
			R_BSP_SoftwareDelay(500, BSP_DELAY_MILLISECS);
		}
    }
    if(WIFI_ERR_TAKE_MUTEX != api_ret)
    {
		/* Give back the socketInUse mutex. */
		wifi_give_mutex(mutex_flag);
    }
	return api_ret;

}

wifi_err_t R_WIFI_SX_ULPGN_SocketClose(int32_t socket_no)
{
	wifi_err_t api_ret = WIFI_SUCCESS;

	if((socket_no >= WIFI_CFG_CREATABLE_SOCKETS) || (socket_no < 0))
	{
		return WIFI_ERR_SOCKET_NUM;
	}
	if( WIFI_SYSTEM_CLOSE == g_wifi_system_state)
	{
		return WIFI_ERR_NOT_OPEN;
	}

	if(g_wifi_socket[socket_no].socket_create_flag == 1)
	{
		R_WIFI_SX_ULPGN_SocketShutdown (socket_no);
		R_BYTEQ_Flush(g_wifi_socket[socket_no].socket_byteq_hdl);
		g_wifi_socket[socket_no].ipversion = 0;
		g_wifi_socket[socket_no].protocol = 0;
		g_wifi_socket[socket_no].ssl_flag = 0;
		g_wifi_socket[socket_no].ssl_type = 0;
		g_wifi_socket[socket_no].socket_status = WIFI_SOCKET_STATUS_CLOSED;
		g_wifi_socket[socket_no].socket_create_flag = 0;
    }
    return api_ret;

