aws/amazon-freertos/vendors/renesas/boards/rx65n-cloud-kit-uart-sx-ulpgn/aws_demos/gcc/src/smc_gen/r_wifi_sx_ulpgn/src/r_wifi_sx_ulpgn_api.c
}

wifi_err_t R_WIFI_SX_ULPGN_DnsQuery (uint8_t *pdomain_name, uint32_t *pipaddress)
{
    int32_t func_ret;
    uint8_t mutex_flag;
	wifi_err_t api_ret = WIFI_SUCCESS;

    if ((NULL == pdomain_name) || (NULL == pipaddress))
    {
    	return WIFI_ERR_PARAMETER;
    }
	if( 0 != R_WIFI_SX_ULPGN_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

    mutex_flag = (MUTEX_TX | MUTEX_RX);
    if(0 != wifi_take_mutex(mutex_flag))
	{
		api_ret = WIFI_ERR_TAKE_MUTEX;
	}
	if(WIFI_SUCCESS == api_ret)
	{
		g_wifi_dnsquery_subcount = 0;
//		sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNDNSQUERY=%s\r", pdomain_name);

		func_ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, 3000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_DNSQUERY, 0xff);
		if(func_ret != 0)
		{
			api_ret = WIFI_ERR_MODULE_COM;
		}
		else
		{
			*pipaddress = g_wifi_dnsaddress;
		}
	}
	if(WIFI_ERR_TAKE_MUTEX != api_ret)
	{
		wifi_give_mutex(mutex_flag);
	}

    return api_ret;

}


wifi_err_t R_WIFI_SX_ULPGN_Ping (uint32_t ipaddr, uint16_t count, uint32_t intervalms)
{
	int32_t func_ret;
	uint8_t mutex_flag;
	uint32_t i;
	wifi_err_t api_ret = WIFI_SUCCESS;
	uint32_t success_count;

	if ((0 == ipaddr) || (0 == count))
	{
		return WIFI_ERR_PARAMETER;
	}
	if( 0 != R_WIFI_SX_ULPGN_IsConnected())
	{
		return WIFI_ERR_NOT_CONNECT;
	}

	if(WIFI_SUCCESS == api_ret)
	{
		success_count = 0;
		for(i=0;i<count;i++)
		{
		    mutex_flag = (MUTEX_TX | MUTEX_RX);
		    if(0 != wifi_take_mutex(mutex_flag))
			{
				api_ret = WIFI_ERR_TAKE_MUTEX;
			}
			if(WIFI_SUCCESS == api_ret)
			{
//				sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNPING=%d.%d.%d.%d\r", \
//						WIFI_ULONG_TO_IPV4BYTE_1(ipaddr),
//						WIFI_ULONG_TO_IPV4BYTE_2(ipaddr),
//						WIFI_ULONG_TO_IPV4BYTE_3(ipaddr),
//						WIFI_ULONG_TO_IPV4BYTE_4(ipaddr));
				func_ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, 20000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_PING, 0xff);
				if(func_ret != 0)
				{
				}
				else
				{
					success_count++;
				}
			}
			if(WIFI_ERR_TAKE_MUTEX != api_ret)
			{
				wifi_give_mutex(mutex_flag);
			}
			if((i+1) < count)
			{
				vTaskDelay(intervalms);
			}
		}
	}
	if(success_count == 0)
	{
		api_ret = WIFI_ERR_MODULE_COM;
	}
	return api_ret;

}

uint32_t R_WIFI_SX_ULPGN_GetVersion(void)
{
    /* These version macros are defined in r_wifi_sx_ulpgn_if.h. */
    return ((((uint32_t)WIFI_SX_ULPGN_VERSION_MAJOR) << 16) | (uint32_t)WIFI_SX_ULPGN_VERSION_MINOR);
}


static int32_t wifi_get_ipaddress(void)
{

    int32_t func_ret;

    func_ret = wifi_execute_at_command(wifi_command_port, "ATNSET=\?\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_IPADDRESS, 0xff);
    if(func_ret != 0)
    {
        return -1;
    }
    return 0;
}


/* return code: from 0 to 5 : socket status
 *              -1 : Error
 * */
static int32_t wifi_get_socket_status(uint8_t socket_no)
{
    int32_t i;
    int32_t ret;

	ret = wifi_execute_at_command(wifi_command_port, "ATNSTAT\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_GET_SOCKET_STATUS, socket_no);
    if(ret != 0)
    {
        return -1;
    }

    if(g_wifi_socket_status < ULPGN_SOCKET_STATUS_MAX)
    {
    	return g_wifi_socket_status;
    }
    else
    {
    	return -1;
    }
}

static int32_t wifi_change_transparent_mode(void)
{
    int32_t i;
    int32_t ret;

    if((ULPGN_USE_UART_NUM == 1) && (g_wifi_transparent_mode == 0) )
    {
		ret = wifi_execute_at_command(wifi_command_port, "ATO\r", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_TRANSPARENT_MODE, 0xff);
		if(ret != 0)
		{
			return -1;
		}
		else
		{
			g_wifi_transparent_mode = 1;
		}
    }
    return 0;
}

static int32_t wifi_change_command_mode(void)
{
	int32_t ret;
    if((ULPGN_USE_UART_NUM == 1) && (g_wifi_transparent_mode == 1) )
    {
        R_BSP_SoftwareDelay(202, BSP_DELAY_MILLISECS);
        g_wifi_transparent_mode = 0;
    	ret = wifi_execute_at_command(wifi_command_port, "+++", 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_COMMAND_MODE, 0xff);
    	if(ret == 0)
    	{
            R_BSP_SoftwareDelay(202, BSP_DELAY_MILLISECS);
    	}
    	else
    	{
    		return -1;
    	}
    }
    return 0;
}


//#if ULPGN_USE_UART_NUM == 2
static int32_t wifi_change_socket_index(uint8_t socket_no)
{
    volatile int32_t timeout;
    int32_t ret = 0;
    uint16_t i;
    uint16_t stored_data_size = 0;
    uint32_t previous_socket_store_data_size = 0;
    uint16_t read_data_size;
    uint8_t before_socket_no;
    uint8_t temprary_buff[64];

    uint32_t previous_atustat_sent,now_atustat_sent,atustat_recv;
    uint8_t sequence;
    uint8_t zero_cnt;
    uint32_t ipl;

    if(ULPGN_USE_UART_NUM == 2)
    {
      	if(socket_no != current_socket_index)
        {
    		sequence = 0;
            before_socket_no = current_socket_index;
            stored_data_size = 0;
            zero_cnt = 0;

//            sprintf((char *)g_wifi_uart[wifi_command_port].command_buff, "ATNSOCKINDEX=%d\r", socket_no);

            ret = wifi_check_uart_state(&atustat_recv, &previous_atustat_sent);
            if(ret != 0)
            {
            	return -1;
            }
			R_BSP_SoftwareDelay(ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_VALUE, ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_PERIOD);

            while(sequence < 0x80)
            {
            	switch(sequence)
            	{
            		case 0:
            			/* Read the remaining data three times and proceed to the next step without data. */
                        /* Enable temporary byte que(default byte que). */
                        g_temporary_byteq_enable_flag = 1;
                        ret = wifi_check_uart_state(&atustat_recv, &now_atustat_sent);
                        if(ret != 0)
                        {
							ret = -1;
							sequence = 0x80;
							break;
                        }

                        do{

        					if(SCI_SUCCESS != R_SCI_Control(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle, SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
        					{
    							ret = -1;
    							sequence = 0x80;
    							break;
        					}
        					if(stored_data_size > 0)
        					{
        						zero_cnt = 0;
        						if(sizeof(temprary_buff) >= stored_data_size)
            					{
            						read_data_size = stored_data_size;
            					}
            					else
            					{
            						read_data_size = sizeof(temprary_buff);
            					}

            					R_SCI_Receive(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle, temprary_buff, read_data_size);

            					for(i = 0; i < read_data_size; i++ )
            					{
            						if(BYTEQ_SUCCESS != R_BYTEQ_Put(g_wifi_socket[current_socket_index].socket_byteq_hdl, *(temprary_buff + i)))
									{
            			                g_wifi_socket[current_socket_index].put_error_count++;
									}
            					}

            					stored_data_size -= read_data_size;
        					}
        					else
        					{
        					}
        				}while(stored_data_size > 0);
                        if(now_atustat_sent == previous_atustat_sent)
                        {
    						zero_cnt++;
                        }
                        else
                        {
    						zero_cnt = 0;
                        }
                        previous_atustat_sent = now_atustat_sent;
            			if(zero_cnt < 2)
            			{
        					R_BSP_SoftwareDelay(ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_VALUE, ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_PERIOD);
            				sequence = 0;
            			}
            			else
            			{
        					R_BSP_SoftwareDelay(ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_VALUE, ULPGN_CFG_SOCKET_CHANGE_TIMEOUT_PERIOD);
        					zero_cnt = 0;
            				sequence = 2;
            			}
            			break;
            		case 2:

                        timeout = 0;
                        g_wifi_uart[wifi_command_port].tx_end_flag = 0;
                        /* Send ATNSOCKINDEX command. */

