aws/amazon-freertos/vendors/renesas/boards/rx65n-cloud-kit-uart-sx-ulpgn/aws_demos/gcc/src/smc_gen/r_wifi_sx_ulpgn/src/r_wifi_sx_ulpgn_api.c
                        g_sockindex_command_flag =1;
            			ret = wifi_execute_at_command(wifi_command_port, g_wifi_uart[wifi_command_port].command_buff, 10000, WIFI_RETURN_ENUM_OK, WIFI_COMMAND_SET_SOCKET_CHANGE, socket_no);
                    	g_sockindex_command_flag =0;
                        if(-1 == ret)
                        {
							ret = -1;
							sequence = 0x80;
							break;
                        }

                        /* Parse command return code. */
						switch(ret)
						{
							case 0:
								/* change socket index to next. */
								current_socket_index = socket_no;

								ret = wifi_check_uart_state(&atustat_recv, &now_atustat_sent);
								if(ret != 0)
								{
									ret = -1;
									sequence = 0x80;
									break;
								}

								if(stored_data_size > 0)
								{
										previous_socket_store_data_size = now_atustat_sent - previous_atustat_sent;
								        WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
										/* Copy data(which stored during socket switching) from temporary buff to current socket buff. */
										while(previous_socket_store_data_size > 0)
										{
											if(SCI_SUCCESS != R_SCI_Control(g_wifi_uart[wifi_command_port].wifi_uart_sci_handle,
													SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
											{
												ret = -1;
												sequence = 0x80;
												break;
											}
											if(stored_data_size > 0)
											{
												if(sizeof(temprary_buff) >= stored_data_size)
												{
													read_data_size = stored_data_size;
												}
												else
												{
													read_data_size = sizeof(temprary_buff);
												}

												if(read_data_size > previous_socket_store_data_size)
												{
													read_data_size = previous_socket_store_data_size;
												}
												if(SCI_SUCCESS != R_SCI_Receive(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,
														 temprary_buff, read_data_size))
												{
													ret = -1;
													sequence = 0x80;
													break;
												}
												else
												{
													for(i = 0; i < read_data_size; i++ )
													{
														if(BYTEQ_SUCCESS != R_BYTEQ_Put(g_wifi_socket[before_socket_no].socket_byteq_hdl, *(temprary_buff + i)))
														{
															g_wifi_socket[before_socket_no].put_error_count++;
														}
													}
													previous_socket_store_data_size -= read_data_size;
												}
											}
										}
								}
								else
								{
							        WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;
								}
//			        				R_BSP_InterruptsDisable();
								/* Copy data(which stored during socket switching) from temporary buff to next socket buff. */
								do{

									if(SCI_SUCCESS != R_SCI_Control(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,  SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
									{
										ret = -1;
										break;
									}
									if(sizeof(temprary_buff) >= stored_data_size)
									{
										read_data_size = stored_data_size;
									}
									else
									{
										read_data_size = sizeof(temprary_buff);
									}

									R_SCI_Receive(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,
											temprary_buff, read_data_size);

									for(i = 0; i < read_data_size; i++ )
									{
										R_BYTEQ_Put(g_wifi_socket[current_socket_index].socket_byteq_hdl, *(temprary_buff + i));
									}

									stored_data_size -= read_data_size;

								}while(stored_data_size > 0);
//			        				R_BSP_InterruptsEnable();
								/* Disable temporary byte que(default byte que). */
//#endif

								g_temporary_byteq_enable_flag = 0;
								ret = 0;
								sequence = 0x80;
								break;
							case -2:  /* BUSY */
								/* If dont change socket because of wifi module busy, copy data from temporary buff to socket buff
								 * and retry change socket command. */

						        WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;

								/* Wait 100us for module to complete send data. */
								R_BSP_SoftwareDelay(100, BSP_DELAY_MICROSECS);
						        WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 1;

								/* Copy data(which stored during socket switching) from temporary buff to current socekt buff. */
								do{

									if(SCI_SUCCESS != R_SCI_Control(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,
											 SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
									{
										ret = -1;
										sequence = 0x80;
									}
									if(stored_data_size > 0)
									{
										if(sizeof(temprary_buff) >= stored_data_size)
										{
											read_data_size = stored_data_size;
										}
										else
										{
											read_data_size = sizeof(temprary_buff);
										}

										R_SCI_Receive(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,
												 temprary_buff, read_data_size);

										for(i = 0; i < read_data_size; i++ )
										{
											if(BYTEQ_SUCCESS != R_BYTEQ_Put(g_wifi_socket[current_socket_index].socket_byteq_hdl, *(temprary_buff + i)))
											{
												g_wifi_socket[current_socket_index].put_error_count++;
											}
										}

										stored_data_size -= read_data_size;
									}
								}while(stored_data_size > 0);
								sequence = 0;
								break;
							default:
								/* This is command error and recovery socket status. */
								ret = -1;
								sequence = 0x80;
								break;
                    	}
            			break;
            	}
            }
            
			if(-1 == ret)
			{
				ipl = R_BSP_CpuInterruptLevelRead();
				R_BSP_CpuInterruptLevelWrite (WIFI_CFG_SCI_INTERRUPT_LEVEL);

				/* Copy data(which stored during socket switching) from temporary buff to current socket buff. */
				do{						

					if(SCI_SUCCESS != R_SCI_Control(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,
							SCI_CMD_RX_Q_BYTES_AVAIL_TO_READ, &stored_data_size))
					{
						break;
					}
					if(stored_data_size > 0)
					{
						if(sizeof(temprary_buff) >= stored_data_size)
						{
							read_data_size = stored_data_size;
						}
						else
						{
							read_data_size = sizeof(temprary_buff);
						}

						R_SCI_Receive(g_wifi_uart[wifi_data_port].wifi_uart_sci_handle,
								temprary_buff, read_data_size);

						for(i = 0; i < read_data_size; i++ )
						{
							if(BYTEQ_SUCCESS != R_BYTEQ_Put(g_wifi_socket[current_socket_index].socket_byteq_hdl, *(temprary_buff + i)))
							{
								g_wifi_socket[current_socket_index].put_error_count++;
							}
						}
						stored_data_size -= read_data_size;
					}
				}while(stored_data_size > 0);
				
				/* Disable temporary byte que(default byte que). */
				g_temporary_byteq_enable_flag = 0;
		        WIFI_RTS_DR(WIFI_CFG_RTS_PORT, WIFI_CFG_RTS_PIN) = 0;

				R_BSP_CpuInterruptLevelWrite (ipl);
				
